# taps
tap "autozimu/formulas"

# formulae
brew "git"
brew "automake"
brew "awscli"
brew "bash"
brew "bison"
brew "php"
brew "composer"
brew "direnv"
brew "gcc"
brew "gpg"
brew "jpeg"
brew "jq"
brew "keychain"
brew "libedit"
brew "libiconv"
brew "libxml2"
brew "libyaml"
brew "make"
brew "mise"
brew "node"
brew "nvm"
brew "openssh"
brew "php-intl"
brew "php@8.3"
brew "pinentry-mac"
brew "pkgconf"
brew "poetry"
brew "python@3.13"
brew "rbenv"
brew "re2c"
brew "unison"
brew "vfox"
brew "vim"
brew "zlib"
brew "zsh"
brew "autozimu/formulas/unison-fsmonitor"

# casks
cask "1password"
cask "1password-cli"
cask "docker-desktop"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "macfuse"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "phpstorm"
